AccumulationRegisters/МаркировкаТоваровВПроизводстве.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>МаркировкаТоваровВПроизводстве</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КодМаркировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаказНаряд</Name>
					<Comment>Заказ-наряд</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.КомплектацияАвтомобиля</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цех</Name>
					<Comment>Цех</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГТД</Name>
					<Comment>Грузовая таможенная декларация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГТД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьКодМаркировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>GTIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодМаркировкиBase64</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/СостоянияКодовМаркировки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СостоянияКодовМаркировки</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияКодовМаркировки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьДатаПечати</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодМаркировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.Перемаркировка</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводВОборотКодовМаркировки</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияАвтомобилей</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаПоступления</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтгрузкаТоваровКодовМаркировки</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеСмены</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеКодовМаркировки</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыводИзОборотаКодовМаркировки</v8:Type>
						<v8:Type>cfg:DocumentRef.Чек</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратВОборотКодовМаркировки</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКодовМаркировки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>GTIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ВнутренниеКодыМаркировок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ВнутренниеКодыМаркировок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВнешнийКодМаркировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>31</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>GTIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВнутреннийКодМаркировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ШтрихКоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ШтрихКоды</Name>
			<Comment>В регистре хранятся сведения о штрих-кодах на товары и карточки</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВыгружатьВОборудование</Name>
					<Comment>Признак выгрузки ШК в торговое оборудование с памятью</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Запрет</Name>
					<Comment>Штрих-код запрещен. Любые действия с этим штрих-кодом запрещены.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ШтрихКод</Name>
					<Comment>Штрих-код товара или карточки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>22</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект штрих-кода (номенклатура или карточка)</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаХранениеШин</v8:Type>
						<v8:Type>cfg:CatalogRef.ЯчейкиХранения</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРемонт</v8:Type>
						<v8:Type>cfg:CatalogRef.ПрочиеАктивы</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияАвтомобилей</v8:Type>
						<v8:Type>cfg:CatalogRef.Карточки</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзвлечениеТоваровИзПроизводства</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.КомплектацияАвтомобиля</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваровВПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаАвтомобиль</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуЗаАвтомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>Единица измерения для которой установлен данный штрих-код</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры для которой установлен данный штрих-код</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СчетчикСерийногоНомераДляВнутреннегоКМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СчетчикСерийногоНомераДляВнутреннегоКМ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>GTIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ОстаткиАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиАвтомобилей</Name>
			<Comment>Блок учета остатков автомобилей</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количественный остаток автомобиля на складе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте регламентированного учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте управленческого учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>Автомобиль</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Comment>Статус партии, определяющий, чей автомобиль (купленный компанией или принятый на комиссию)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Comment>Партия по которой поступил или был взят на комиссию автомобиль</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыПартий</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГТД</Name>
					<Comment>ГТД</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГТД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипыРемонта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыРемонта</Name>
			<Comment>Типы ремонта (платный/бесплатный)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Платный</Name>
					<Comment>Ремонт платный</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бесплатный</Name>
					<Comment>Ремонт бесплатный</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/Модуль_ГВС/Ext/Module.bsl
Процедура СМГ_СписаниеМаркировки(Объект) Экспорт
	
	Если Не(ТипЗнч(Объект) = Тип("ДокументОбъект.ЗаказНаряд")) Тогда      
		Возврат;
	КонецЕсли;
	
		СостояниеКодаМаркировки = ?(Объект.ВидРемонта.ТипРемонта = Перечисления.ТипыРемонта.Платный,
		Перечисления.СостоянияКодовМаркировки.ВыведенИзОборотаРозничнаяПродажа,
		Перечисления.СостоянияКодовМаркировки.ВыведенИзОборотаИспользованДляСобственныхНуждПредприятия);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказНарядТовары.Цена КАК Цена,
		|	МаркировкаТоваровВПроизводстве.ЗаказНаряд КАК ЗаказНаряд,
		|	МаркировкаТоваровВПроизводстве.Номенклатура КАК Номенклатура,
		|	""(01)"" + МаркировкаТоваровВПроизводстве.GTIN + ""(21)"" + МаркировкаТоваровВПроизводстве.СерийныйНомер КАК КодМаркировки,
		|	МаркировкаТоваровВПроизводстве.КодМаркировкиBase64 КАК КодМаркировкиBase64,
		|	МаркировкаТоваровВПроизводстве.ГТД КАК ГТД
		|ИЗ
		|	РегистрНакопления.МаркировкаТоваровВПроизводстве КАК МаркировкаТоваровВПроизводстве
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаряд.Товары КАК ЗаказНарядТовары
		|		ПО МаркировкаТоваровВПроизводстве.ЗаказНаряд = ЗаказНарядТовары.Ссылка
		|			И МаркировкаТоваровВПроизводстве.Номенклатура = ЗаказНарядТовары.Номенклатура
		|ГДЕ
		|	МаркировкаТоваровВПроизводстве.ЗаказНаряд = &ЗаказНаряд
		|	И МаркировкаТоваровВПроизводстве.ВидДвижения = &ВидДвижения";
		
		Запрос.УстановитьПараметр("ЗаказНаряд", Объект.Ссылка);
		Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Приход);
		
		ТаблицаКодовМаркировки = Запрос.Выполнить();
		
		СМГ_ВыводИзОборотаМаркированнойНоменклатуры(ТаблицаКодовМаркировки,СостояниеКодаМаркировки,Объект); 
			
КонецПроцедуры

Процедура СМГ_ВыводИзОборотаМаркированнойНоменклатуры (ТаблицаКодовМаркировки,СостояниеКодаМаркировки,Объект)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВыводИзОборотаКодовМаркировки.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ВыводИзОборотаКодовМаркировки КАК ВыводИзОборотаКодовМаркировки
	|ГДЕ
	|	ВыводИзОборотаКодовМаркировки.ДокументОснование = &ДокументОснование
	|	И ВыводИзОборотаКодовМаркировки.Проведен
	|	И НЕ ВыводИзОборотаКодовМаркировки.ПометкаУдаления";
	Запрос.УстановитьПараметр("ДокументОснование",Объект.Ссылка);
	Пустой = Запрос.Выполнить().Пустой();
	
	Если Пустой Тогда
		
		Если Не ТаблицаКодовМаркировки.Пустой() Тогда //Если есть маркированный товар тогда начинаем списывать коды маркировки 
			
			Если СостояниеКодаМаркировки = Перечисления.СостоянияКодовМаркировки.ВыведенИзОборотаРозничнаяПродажа Тогда   
				ПричинаВывода = Перечисления.ПричиныВыводаИзОборота.РозничнаяПродажа;
			ИначеЕсли СостояниеКодаМаркировки = Перечисления.СостоянияКодовМаркировки.ВыведенИзОборотаИспользованДляСобственныхНуждПредприятия Тогда
				ПричинаВывода = Перечисления.ПричиныВыводаИзОборота.ДляСобственныхНужд;
			КонецЕсли;
			
			ВыводИзОборота = Документы.ВыводИзОборотаКодовМаркировки.СоздатьДокумент();
			ВыводИзОборота.Организация                     = Объект.Организация; 
			ВыводИзОборота.Дата                            = Объект.Дата;
			ВыводИзОборота.Статус                          = Перечисления.СтатусыВыводаИзОборота.Выполнен;
			ВыводИзОборота.ПричинаВывода                   = ПричинаВывода;
			ВыводИзОборота.ДокументОснование               = Объект.Ссылка;
			ВыводИзОборота.ВидПервичногоДокумента          = Перечисления.ВидыПервичныхДокументов.Прочее;
			ВыводИзОборота.НаименованиеПервичногоДокумента = Строка(Объект.Ссылка);
			ВыводИзОборота.НомерПервичногоДокумента        = Объект.Номер;
			ВыводИзОборота.ДатаПервичногоДокумента         = Объект.Дата;
			ВыводИзОборота.ДатаВыводаИзОборота             = ТекущаяДата();
			ВыводИзОборота.Автор                           = Объект.Автор;
			ВыводИзОборота.ПодразделениеКомпании           = Объект.ПодразделениеКомпании;
			
			ОбходНоменклатура          = ТаблицаКодовМаркировки.Выгрузить();
			ОбходНоменклатура.Свернуть("Номенклатура,Цена");
			КодыМаркировкиНоменклатуры = ТаблицаКодовМаркировки.Выгрузить();
			КодыМаркировкиНоменклатуры.Свернуть("Номенклатура,КодМаркировкиBase64,КодМаркировки");
			
			Для Каждого Строка Из ОбходНоменклатура Цикл
				//Галактионов ЧЗ ++
				Если Строка.Номенклатура.ТипНоменклатуры = Справочники.ТипыНоменклатуры.НайтиПоКоду("ЦБ000096") Тогда
					Продолжить;
				КонецЕсли;
				//Галактионов ЧЗ ++
				СтрокаТовара = ВыводИзОборота.Товары.Добавить();
				СтрокаТовара.Номенклатура = Строка.Номенклатура;
				СтрокаТовара.Цена         = Строка.Цена; // Вытянуть цену
				ВыводИзОборота.ОбработкаРеквизита("Товары.Номенклатура",СтрокаТовара);
				
				ПарОтбора = Новый Структура();
				ПарОтбора.Вставить("Номенклатура",СтрокаТовара.Номенклатура);
				
				НайденныеСтроки = КодыМаркировкиНоменклатуры.НайтиСтроки(ПарОтбора);
				СтрокаТовара.Количество         = НайденныеСтроки.Количество();	
				Если НайденныеСтроки.Количество() > 0  Тогда
					Для Каждого Строка Из НайденныеСтроки Цикл
						НоваяСтрокаКодовМаркировки = ВыводИзОборота.КодыМаркировки.Добавить();			
						НоваяСтрокаКодовМаркировки.ИдентификаторТовара = СтрокаТовара.ИдентификаторТовара;
						НоваяСтрокаКодовМаркировки.КодМаркировки       = Строка.КодМаркировки;
					КонецЦикла;
				КонецЕсли; 	
			КонецЦикла;   
			ВыводИзОборота.Записать(РежимЗаписиДокумента.Проведение);
			ОтправкаЗапросаВыводаИзОборота(ВыводИзОборота,Объект);
		Иначе
			Если РольДоступна("ПолныеПрава") Тогда
				Сообщить("В заказ-наряде нет маркированного товара.") 
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры 
	
Процедура ОтправкаЗапросаВыводаИзОборота(Документ,Объект)
	
	ПричинаВывода = УправлениеКодамиМаркировкиКлиентСервер.ПричинаВыводаИзОборотаCSV(Документ.ПричинаВывода);
	
	Если НЕ ЗначениеЗаполнено(ПричинаВывода) Тогда
		Возврат;
	КонецЕсли;
	
	СтрОрганизация = Строка(Объект.Организация);
	ИмяКаталога  = "\\sokolmotors.lan\global\_Управляющая компания\Честный знак\ВыгрузкаМаркировки\"+СтрОрганизация;
	
	КаталогНаДиске = Новый Файл(ИмяКаталога); 
    Если Не КаталогНаДиске.Существует() Тогда
        СоздатьКаталог(ИмяКаталога);
		СоздатьКаталог(ИмяКаталога + "\Реализация-Авто");
		СоздатьКаталог(ИмяКаталога + "\Заказ-Наряд");
    КонецЕсли;
				
	ВидПервичногоДокумента = УправлениеКодамиМаркировкиКлиентСервер.ВидПервичногоДокументаCSV(Документ.ВидПервичногоДокумента);
	
	НаименованиеПервичногоДокумента = "";
	Если Документ.ВидПервичногоДокумента = Перечисления.ВидыПервичныхДокументов.Прочее Тогда
		НаименованиеПервичногоДокумента = Документ.НаименованиеПервичногоДокумента;
	КонецЕсли;
	
	ИмяФайла = "З_Н_Ч_" + Строка(Объект.Номер)+ "" + СтрОрганизация; 
	Расширение_ = ".csv";	
	ИмяКаталога  = ИмяКаталога+"\Заказ-Наряд\"+СтрЗаменить(Формат(Документ.Дата, "ДФ=yyyy.MM.dd"), ".", "_");
	
	КаталогНаДиске = Новый Файл(ИмяКаталога);
	
	Если Не КаталогНаДиске.Существует() Тогда
		СоздатьКаталог(ИмяКаталога);
	КонецЕсли;  
	
	ФайлИмя = ИмяКаталога+"\"+ИмяФайла+Расширение_;  
	
	ТекстовыйФайл = Новый ТекстовыйДокумент();
	
	ПричинаВывода = СокрЛП(СтрЗаменить(Строка(ПричинаВывода),"предприятия",""));
	
	
	ТекстовыйФайл = ДобавитьТекст(ТекстовыйФайл,Документ,ПричинаВывода,ВидПервичногоДокумента,НаименованиеПервичногоДокумента);	
	ТекстовыйФайл.Записать(ФайлИмя, КодировкаТекста.UTF8,Символы.ПС);
	//\Заказ-Наряд\
КонецПроцедуры 

Функция ДобавитьТекст (ТекстовыйФайл,Документ,ПричинаВывода,ВидПервичногоДокумента,НаименованиеПервичногоДокумента) 
	
	ТекстовыйФайл.ДобавитьСтроку(
		"ИНН участника оборота,Причина вывода из оборота,Дата вывода из оборота,Тип первичного документа,"
		+ "Номер первичного документа,Дата первичного документа,Наименование первичного документа,"
		+ "Регистрационный номер ККТ,Версия");
	ТекстовыйФайл.ДобавитьСтроку(
		СтрШаблон("%1,%2,%3,%4,%5,%6,%7,%8,%9",
			СокрЛП(Документ.Организация.ИНН),
			ПричинаВывода,
			Формат(Документ.ДатаВыводаИзОборота, "ДФ=dd.MM.yyyy"),
			ВидПервичногоДокумента,
			Документ.НомерПервичногоДокумента,
			Формат(Документ.ДатаПервичногоДокумента, "ДФ=dd.MM.yyyy"),
			НаименованиеПервичногоДокумента,
			"",
			"4"));
	ТекстовыйФайл.ДобавитьСтроку("Параметры товаров,,,,,");
	ТекстовыйФайл.ДобавитьСтроку("КИ,Цена за единицу,Тип первичного документа,Номер первичного документа,"
		+ "Дата первичного документа,Наименование первичного документа");
	
	ОбъектШК = Обработки.ШтрихКоды.Создать();
	Для Каждого ТекущаяСтрока Из Документ.КодыМаркировки Цикл
		
		СтруктураМаркировки = ОбъектШК.РазобратьСтрокуШтрихкодаGS1(ТекущаяСтрока.КодМаркировки);
		
		Если НЕ СтруктураМаркировки.Разобран Тогда
			Продолжить;
		КонецЕсли;
		
		Идентификатор01 = "01" + СтруктураМаркировки.ДанныеШтрихкода["01"].Значение;
		// Замена по специфике csv
		Идентификатор21 = "21" + СтруктураМаркировки.ДанныеШтрихкода["21"].Значение;
		
		КИ = Идентификатор01 + Идентификатор21;
		КИ = СтрЗаменить(КИ, """", """""");
		
		// Параметры по ТЧ Товары
		НайденнаяСтрока = Документ.Товары.Найти(ТекущаяСтрока.ИдентификаторТовара, "ИдентификаторТовара");
		
		Цена = СтрЗаменить(Строка(НайденнаяСтрока.Цена * 100), Символы.НПП, "");
		
		ВидПервичногоДокумента = "";
		НомерПервичногоДокумента = "";
		ДатаПервичногоДокумента = "";
		НаименованиеПервичногоДокумента = "";
		Если ЗначениеЗаполнено(НайденнаяСтрока.ВидПервичногоДокумента) Тогда
			ВидПервичногоДокумента = УправлениеКодамиМаркировкиКлиентСервер.ВидПервичногоДокументаCSV(НайденнаяСтрока.ВидПервичногоДокумента);
			НомерПервичногоДокумента = НайденнаяСтрока.НомерПервичногоДокумента;
			ДатаПервичногоДокумента = Формат(НайденнаяСтрока.ДатаПервичногоДокумента, "ДФ=dd.MM.yyyy");
			Если НайденнаяСтрока.ВидПервичногоДокумента = Перечисления.ВидыПервичныхДокументов.Прочее Тогда
				НаименованиеПервичногоДокумента = НайденнаяСтрока.НаименованиеПервичногоДокумента;
			КонецЕсли;
		КонецЕсли;
		
		ТекстовыйФайл.ДобавитьСтроку(
			СтрШаблон(
				"%1,%2,%3,%4,%5,%6",
				"""" + КИ + """",
				Цена,
				ВидПервичногоДокумента,
				НомерПервичногоДокумента,
				ДатаПервичногоДокумента,
				НаименованиеПервичногоДокумента));
		
	КонецЦикла;
	
	ТекстовыйФайл.УстановитьТекст(СтрЗаменить(ТекстовыйФайл.ПолучитьТекст() + Символы.ПС, Символы.ПС + Символы.ПС, ""));
	Возврат ТекстовыйФайл;
	
КонецФункции //Галактионов -- 10.02.2024 ЧестныйЗнак

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


//Честный_знак_10.10.2024

//1.Проверка таблицы на наличие маркированной номенклатуры
Функция Присутствие_Маркированная_Номенклатура(Товары) Экспорт
	
	Количество_Маркированной_Номенклатуры = 0; //Количество номенклатурных позиций
	Количество_В_Позиции = 0;                  //Количество в позиции
	
	Для Каждого Строка Из Товары Цикл
		ЭтоМаркируемаяНоменклатура = дкЭтоМаркируемаяНоменклатура(Строка.Номенклатура);
		Количество_Маркированной_Номенклатуры = ?(ЭтоМаркируемаяНоменклатура,Количество_Маркированной_Номенклатуры + 1,Количество_Маркированной_Номенклатуры);
		Количество_В_Позиции = ?(ЭтоМаркируемаяНоменклатура,Количество_В_Позиции + Строка.Количество,Количество_В_Позиции);
	КонецЦикла;
	
	Итог = Новый Структура ("Маркировка_Присутствует,Количество,Сумма_Количество_В_Позициях"
	,Булево(Количество_Маркированной_Номенклатуры)
	,Количество_Маркированной_Номенклатуры
	,Количество_В_Позиции);
	Возврат Итог;
	
КонецФункции

//2.Вывод кнопки на форму
Процедура Видимость_Кнопки_Загрузки_Файлов(ЭлементыФормы,Товары) Экспорт
	
	Параметры = Присутствие_Маркированная_Номенклатура(Товары);
	
	Если Параметры.Маркировка_Присутствует Тогда
		ЭлементыФормы.КоманднаяПанельТовары.Кнопки.Хранилище_Файлов_Честный_Знак.Доступность = Истина;
	Иначе 
		ЭлементыФормы.КоманднаяПанельТовары.Кнопки.Хранилище_Файлов_Честный_Знак.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

//3.Процедура состояний кнопки
Процедура Состояние_Хранилища_Файлов(ЭлементыФормы,Объект) Экспорт
	
	Значение_Хранилище_Файлов_Честный_Знак = Объект.Хранилище_Файлов_Честный_Знак.Получить();
	Кнопка_Загрузки_Файлов = ЭлементыФормы.КоманднаяПанельТовары.Кнопки.Хранилище_Файлов_Честный_Знак; 
	
	Если Значение_Хранилище_Файлов_Честный_Знак = Неопределено И Кнопка_Загрузки_Файлов.Доступность Тогда
		Кнопка_Загрузки_Файлов.Текст = "Загрузите файлы из честного знака";
		Кнопка_Загрузки_Файлов.Картинка = БиблиотекаКартинок.Нет;
	ИначеЕсли ТипЗнч(Значение_Хранилище_Файлов_Честный_Знак) = Тип("Массив") И Кнопка_Загрузки_Файлов.Доступность Тогда
		Кнопка_Загрузки_Файлов.Текст = "Данные загружены";
		Кнопка_Загрузки_Файлов.Картинка = БиблиотекаКартинок.Да;
	ИначеЕсли Не Кнопка_Загрузки_Файлов.Доступность Тогда
		Кнопка_Загрузки_Файлов.Текст = "";
		Кнопка_Загрузки_Файлов.Картинка = БиблиотекаКартинок.Пусто;
		Если Значение_Хранилище_Файлов_Честный_Знак <> Неопределено Тогда
			Объект.Коды_Маркировки_Честный_Знак.Очистить();
			Объект.Хранилище_Файлов_Честный_Знак = Новый ХранилищеЗначения(Неопределено);	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

//4.Загрузка и разбор файлов из честного знака
Процедура Загрузка_И_Разбор_Файлов_Из_Честного_Знака(Объект,Макет)
	
	Текст_Из_Файла = Новый ТекстовыйДокумент;
	
	Массив_Файлов = Новый Массив();
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);	
	ДиалогВыбораФайла.Заголовок  = "Выбирите файл(ы): ";
	ДиалогВыбораФайла.Расширение = "xml"; 
	ДиалогВыбораФайла.Фильтр     = "(*.xml)|*.xml";
	ДиалогВыбораФайла.МножественныйВыбор = Истина;
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		Для Каждого Файл_Путь Из ДиалогВыбораФайла.ВыбранныеФайлы Цикл 	
			Текст_Из_Файла.Прочитать(Файл_Путь);
			Текст_XML = Текст_Из_Файла.ПолучитьТекст();
			Таблица_Значений = Преобразовать_XML_в_Таблица_Значений(Текст_XML,Макет);
			Файл = Новый Файл(Файл_Путь);
			Имя_Файла = Файл.Имя;	
			Если Таблица_Значений.Количество() = 0 Тогда
				Сообщить("В файле " + Имя_Файла + " отсутствует маркировка, файл не будет записан в документ.");
				Продолжить;
			Иначе
				Объект.Коды_Маркировки_Честный_Знак.Очистить();
				РазборСроки = Обработки.ШтрихКоды.Создать();
				Для Каждого Строка Из Таблица_Значений Цикл 
					Новая_Строка = Объект.Коды_Маркировки_Честный_Знак.Добавить(); 
					Структура = РазборСроки.РазобратьСтрокуШтрихкодаGS1(Строка.Колонка1,Истина,Истина);
					//Новая_Строка.КодМаркировки = "(01)" + Структура.ДанныеШтрихкода["01"].Значение + "(21)" + Структура.ДанныеШтрихкода["21"].Значение; 
					Новая_Строка.КодМаркировки = Строка.Колонка1;
				КонецЦикла;
				Массив_Файлов.Добавить(Новый ДвоичныеДанные(Файл_Путь));
				Объект.Хранилище_Файлов_Честный_Знак = Новый ХранилищеЗначения(Массив_Файлов,Новый СжатиеДанных(9));
				Сообщить("Файл " + Имя_Файла + " записан в документ.");
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

//5.Текст XML в таблицу
Функция Преобразовать_XML_в_Таблица_Значений(Текст_XML,Макет);
	
	СхемаПреобразования = Макет; 
	СхемаПреобразования = СхемаПреобразования.ПолучитьТекст();
	
	ПроцессорПреобразования = Новый ПреобразованиеXSL;
	ПроцессорПреобразования.ЗагрузитьИзСтроки(СхемаПреобразования);
	РезультатПреобразованияXML = ПроцессорПреобразования.ПреобразоватьИзСтроки(Текст_XML);
	ЧтениеXML = Новый ЧтениеXML();
	ЧтениеXML.УстановитьСтроку(РезультатПреобразованияXML);
	Таблица_Значений = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
	
	Возврат Таблица_Значений;
	
КонецФункции

//6.Процедура кнопки
Процедура Выполнение_Кнопки(Объект,Форма) Экспорт
	
	Объект.Коды_Маркировки_Честный_Знак.Очистить();
	Загрузка_И_Разбор_Файлов_Из_Честного_Знака(Объект,Объект.ПолучитьМакет("Сценарий"));
	Состояние_Хранилища_Файлов(Форма.ЭлементыФормы,Объект);
	
КонецПроцедуры

//7.Проведение с маркированной номенклатурой 
Процедура Проведение_С_Маркированной_Номенклатурой(Объект,Отказ) Экспорт  
	
	Параметры = Присутствие_Маркированная_Номенклатура(Объект.Товары); 
	
	Маркировки_Нет = Не Параметры.Маркировка_Присутствует;
	
	Если Маркировки_Нет Тогда
		Возврат;
	КонецЕсли;
	
	Значение_Хранилище_Файлов_Честный_Знак = Объект.Хранилище_Файлов_Честный_Знак.Получить();
	
	Если Значение_Хранилище_Файлов_Честный_Знак = Неопределено Тогда
		Отказ = Истина;
		Сообщить("Файл(ы) с честного знакак не загружен(ы)!!!"
		        "Проведение отменено.");
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	//Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = Текст_Запроса();
	Таблица_С_Маркировкой_Из_Документа_ТЗ = Таблица_С_Маркировкой_Из_Документа(Объект.КодыМаркировки);
	Для Каждого Строка Из Таблица_С_Маркировкой_Из_Документа_ТЗ Цикл
		Строка.КодМаркировки = СтрЗаменить(СтрЗаменить(Строка.КодМаркировки,"(01)","01"),"(21)","21");
	КонецЦикла; 
	Коды_Маркировки_Честный_Знак_ТЗ = Объект.Коды_Маркировки_Честный_Знак.Выгрузить();
	Для Каждого Строка Из Коды_Маркировки_Честный_Знак_ТЗ Цикл
		Строка.КодМаркировки = СтрЗаменить(СтрЗаменить(Строка.КодМаркировки,"(01)","01"),"(21)","21");
	КонецЦикла;
	Запрос.УстановитьПараметр("ТаблицаСМаркировкойИзДокумента",Таблица_С_Маркировкой_Из_Документа_ТЗ);
	Запрос.УстановитьПараметр("МаркировкаИзФайлаЧестногоЗнака",Коды_Маркировки_Честный_Знак_ТЗ);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	Если Таблица.Количество() > 0 Тогда
		Таблицу_Значений_В_Табличный_Документ(Таблица).Показать();
		Сообщить("Проведение отменено,QR-коды не совпадают.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

Функция Таблицу_Значений_В_Табличный_Документ(Таблица) 
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Построитель = Новый ПостроительОтчета;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(Таблица);       
	Построитель.Вывести(ТабличныйДокумент);
		
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция Таблица_С_Маркировкой_Из_Документа(КодыМаркировки)
	
	Таблица_С_Маркировкой_Из_Документа = КодыМаркировки.ВыгрузитьКолонки("КодМаркировки");
	РазборСроки = Обработки.ШтрихКоды.Создать();
	Для Каждого Строка Из КодыМаркировки Цикл 	
		Новая_Строка = Таблица_С_Маркировкой_Из_Документа.Добавить();
		Строка_QR = "" + Строка.КодМаркировки;
		Структура = РазборСроки.РазобратьСтрокуШтрихкодаGS1(Строка_QR,Истина,Истина);
		//Новая_Строка.КодМаркировки = "(01)" + Структура.ДанныеШтрихкода["01"].Значение + "(21)" + Структура.ДанныеШтрихкода["21"].Значение;	
		Новая_Строка.КодМаркировки = Строка_QR;
	КонецЦикла;
	
	Возврат Таблица_С_Маркировкой_Из_Документа;
	
КонецФункции

Функция Текст_Запроса()
	
	Текст = "ВЫБРАТЬ
	        |	МаркировкаИзДокумента.КодМаркировки КАК КодМаркировки,
	        |	1 КАК Состояние
	        |ПОМЕСТИТЬ ТаблицаСМаркировкойИзДокумента1
	        |ИЗ
	        |	&ТаблицаСМаркировкойИзДокумента КАК МаркировкаИзДокумента
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	МаркировкаИзФайлаЧестногоЗнака.КодМаркировки КАК КодМаркировки,
	        |	-1 КАК Состояние
	        |ПОМЕСТИТЬ МаркировкаИзФайлаЧестногоЗнака1
	        |ИЗ
	        |	&МаркировкаИзФайлаЧестногоЗнака КАК МаркировкаИзФайлаЧестногоЗнака
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ТаблицаСМаркировкойИзДокумента.КодМаркировки КАК КодМаркировки,
	        |	ТаблицаСМаркировкойИзДокумента.Состояние КАК Состояние
	        |ПОМЕСТИТЬ ОбъединенеиеМаркировки
	        |ИЗ
	        |	ТаблицаСМаркировкойИзДокумента1 КАК ТаблицаСМаркировкойИзДокумента
	        |
	        |ОБЪЕДИНИТЬ
	        |
	        |ВЫБРАТЬ
	        |	МаркировкаИзФайлаЧестногоЗнака.КодМаркировки,
	        |	МаркировкаИзФайлаЧестногоЗнака.Состояние
	        |ИЗ
	        |	МаркировкаИзФайлаЧестногоЗнака1 КАК МаркировкаИзФайлаЧестногоЗнака
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	Объединенеие_Маркировки.КодМаркировки КАК КодМаркировки,
	        |	СУММА(Объединенеие_Маркировки.Состояние) КАК Состояние
	        |ПОМЕСТИТЬ Итог1
	        |ИЗ
	        |	ОбъединенеиеМаркировки КАК Объединенеие_Маркировки
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	Объединенеие_Маркировки.КодМаркировки
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	Итог_1.КодМаркировки КАК КодМаркировки,";
			Если РольДоступна("ПолныеПрава") Тогда
				Текст = Текст + "Итог_1.Состояние КАК Состояние,";
			КонецЕсли;
			Текст = Текст +"
			|	ВЫБОР
	        |		КОГДА Итог_1.Состояние = 1
	        |			ТОГДА ""Код не найден в файле честного знака""
	        |		КОГДА Итог_1.Состояние = -1
	        |			ТОГДА ""Код не найден в документе поступления""
	        |	КОНЕЦ КАК Информация
	        |ИЗ
	        |	Итог1 КАК Итог_1
	        |ГДЕ
	        |	Итог_1.Состояние <> 0";
	
	Возврат Текст;
	
КонецФункции

Функция ЕстьКириллица(ИсходнаяСтрока) Экспорт
	
	ЕстьКириллица=ложь;
	ИсходнаяСтрока=СокрЛП(ИсходнаяСтрока);
	Если СтрДлина(ИсходнаяСтрока)>0 Тогда
		Для Сч=1 по СтрДлина(ИсходнаяСтрока) Цикл
			Символ = НРег(Сред(ИсходнаяСтрока, Сч, 1));
			Если Найти("абвгдеёжзийклмнопрстуфхцчшщъыьэюя", Символ) Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Ложь;  
	
КонецФункции

//8. Запрет проведения БУ шины
Процедура Запрет_Проведения_БУ_Шин (Отказ,Товары) Экспорт	
	Для Каждого Строка Из Товары Цикл
		Тип_Номенклатуры = Строка.Номенклатура.ТипНоменклатуры;
		Шины_БУ = Справочники.ТипыНоменклатуры.НайтиПоКоду("ЦБ000090"); 
		Право_Проведение_С_Бу_Шинами = обПраво("РазрешитьПроведениеПоступленияСБуШинами"); 
		
		Если Тип_Номенклатуры = Шины_БУ Тогда
			
			Если Право_Проведение_С_Бу_Шинами Тогда  
				Возврат;
			КонецЕсли; 
			
			Отказ = Истина;
			Сообщить("Запрещенно проводить документ в котором присутствует номенклатура с типом шина БУ.
			        |Номенклатура:<"+Строка.Номенклатура.Наименование+">");
			Возврат;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

//9. QR-Код в базе 
Функция ПроверкаКорректностиВведенныхQRКодов(Источник) Экспорт
	
	Отказ = Ложь;
	//1. Разбор QRКода и получение таблицы значений для дальнейшей сверки
	ТаблицаКодовМаркировок = РазборQRКода(Источник);
	
	//2. Проверяем в регистре сведений "Состояние кодов маркировки" присутствие QR-кода
	НайденныеQRКоды = ПрисутствиеQRКодаВРегистре(ТаблицаКодовМаркировок,Источник);
	
	//3. Сраниваем 2 таблицы с QR кодами
	Для Каждого ТекущаяСтрока Из ТаблицаКодовМаркировок Цикл 
		
		ПараметрыПоиска = Новый Структура;
		ПараметрыПоиска.Вставить("Номенклатура" ,ТекущаяСтрока.Номенклатура );
		ПараметрыПоиска.Вставить("Организация"  ,Источник.Организация       );
		ПараметрыПоиска.Вставить("GTIN"         ,ТекущаяСтрока.GTIN         );
		ПараметрыПоиска.Вставить("СерийныйНомер",ТекущаяСтрока.СерийныйНомер);
		ПараметрыПоиска.Вставить("Состояние"    ,Перечисления.СостоянияКодовМаркировки.ВведенВОборот);
		
		Поиск = НайденныеQRКоды.НайтиСтроки(ПараметрыПоиска);
		
		Если Поиск.Количество() = 0 Тогда 
			ТекстСообщений = СтрШаблон("У организации <%1> в номенклатеру <%2> отсутвует QR-код <%3> в статусе В Обороте в базе данных.Проверьте документ поступление товаров.",Источник.Организация,ТекущаяСтрока.Номенклатура,ТекущаяСтрока.КодМаркировки);	
			Сообщить(ТекстСообщений,СтатусСообщения.ОченьВажное);
			Отказ = Истина;
		КонецЕсли;	
	КонецЦикла;  
	
	Возврат Отказ;
	
КонецФункции

Функция РазборQRКода (Источник) 
	
	ТаблицаКодовМаркировок = Новый ТаблицаЗначений;
	ТаблицаКодовМаркировок.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаКодовМаркировок.Колонки.Добавить("ИдентификаторТовара",Новый ОписаниеТипов("Строка"));
	ТаблицаКодовМаркировок.Колонки.Добавить("КодМаркировки",Новый ОписаниеТипов("Строка"));
	ТаблицаКодовМаркировок.Колонки.Добавить("GTIN",Новый ОписаниеТипов("Строка"));
	ТаблицаКодовМаркировок.Колонки.Добавить("СерийныйНомер",Новый ОписаниеТипов("Строка"));
	
	ОбработкаШК = Обработки.ШтрихКоды.Создать();
	
	Для Каждого ТекущаяСтрока Из Источник.КодыМаркировки Цикл
		
		НоваяСтрока = ТаблицаКодовМаркировок.Добавить();
		
		СтруктураМаркировки =
		ОбработкаШК.РазобратьСтрокуШтрихкодаGS1(ТекущаяСтрока.КодМаркировки, Истина); 
		
		Если НЕ СтруктураМаркировки.Разобран Тогда
			Продолжить;
		КонецЕсли; 
		НоваяСтрока.Номенклатура        = Источник.Товары.Найти(ТекущаяСтрока.ИдентификаторТовара,"ИдентификаторТовара").Номенклатура;
		НоваяСтрока.ИдентификаторТовара = ТекущаяСтрока.ИдентификаторТовара;
		НоваяСтрока.КодМаркировки       = ТекущаяСтрока.КодМаркировки;
		НоваяСтрока.GTIN                = СтруктураМаркировки.ДанныеШтрихкода["01"].Значение;
		НоваяСтрока.СерийныйНомер       = СтруктураМаркировки.ДанныеШтрихкода["21"].Значение;	
		
	КонецЦикла;
	
	Возврат ТаблицаКодовМаркировок; 
	
КонецФункции 

Функция ПрисутствиеQRКодаВРегистре (ТаблицаКодовМаркировок,Источник)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаКодовМаркировки.СерийныйНомер КАК СерийныйНомер,
		|	ТаблицаКодовМаркировки.GTIN КАК GTIN
		|ПОМЕСТИТЬ ТаблицаКодовМаркировки
		|ИЗ
		|	&ТаблицаКодовМаркировки КАК ТаблицаКодовМаркировки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СостоянияКодовМаркировкиСрезПоследних.Период КАК Период,
		|	СостоянияКодовМаркировкиСрезПоследних.Номенклатура КАК Номенклатура,
		|	СостоянияКодовМаркировкиСрезПоследних.Организация КАК Организация,
		|	СостоянияКодовМаркировкиСрезПоследних.GTIN КАК GTIN,
		|	СостоянияКодовМаркировкиСрезПоследних.СерийныйНомер КАК СерийныйНомер,
		|	СостоянияКодовМаркировкиСрезПоследних.Состояние КАК Состояние
		|ПОМЕСТИТЬ СостояниеQRКодаВРегистреПоследнийСрез
		|ИЗ
		|	РегистрСведений.СостоянияКодовМаркировки.СрезПоследних(
		|			&Дата,
		|			(СерийныйНомер, GTIN) В
		|				(ВЫБРАТЬ
		|					ТаблицаКодовМаркировки.СерийныйНомер КАК СерийныйНомер,
		|					ТаблицаКодовМаркировки.GTIN КАК GTIN
		|				ИЗ
		|					ТаблицаКодовМаркировки КАК ТаблицаКодовМаркировки)) КАК СостоянияКодовМаркировкиСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(СостояниеQRКодаВРегистреПоследнийСрез.Период) КАК Период
		|ПОМЕСТИТЬ ПоследняяДатаQRКода
		|ИЗ
		|	СостояниеQRКодаВРегистреПоследнийСрез КАК СостояниеQRКодаВРегистреПоследнийСрез
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(СостояниеQRКодаВРегистреПоследнийСрез.Период, ДЕНЬ) КАК Период,
		|	СостояниеQRКодаВРегистреПоследнийСрез.Номенклатура КАК Номенклатура,
		|	СостояниеQRКодаВРегистреПоследнийСрез.Организация КАК Организация,
		|	СостояниеQRКодаВРегистреПоследнийСрез.GTIN КАК GTIN,
		|	СостояниеQRКодаВРегистреПоследнийСрез.СерийныйНомер КАК СерийныйНомер,
		|	СостояниеQRКодаВРегистреПоследнийСрез.Состояние КАК Состояние
		|ИЗ
		|	ПоследняяДатаQRКода КАК ПоследняяДатаQRКода
		|		ЛЕВОЕ СОЕДИНЕНИЕ СостояниеQRКодаВРегистреПоследнийСрез КАК СостояниеQRКодаВРегистреПоследнийСрез
		|		ПО (НАЧАЛОПЕРИОДА(СостояниеQRКодаВРегистреПоследнийСрез.Период, ДЕНЬ) = НАЧАЛОПЕРИОДА(ПоследняяДатаQRКода.Период, ДЕНЬ))";
	
	Запрос.УстановитьПараметр("ТаблицаКодовМаркировки",ТаблицаКодовМаркировок);
	Запрос.УстановитьПараметр("Дата",Источник.Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();			
		
КонецФункции

//Дадов 20260916 ++
//Это удалить потом++
Процедура ПечатьРеальногоКМ_ТЕСТ(РеальныйКМ) Экспорт 		
	Обработка = Обработки.ПечатьКодовМаркировки.Создать();
	Обработка.ПечатьDataMatrix(РеальныйКМ, Истина);	
КонецПроцедуры
//Это удалить потом--

Процедура ПолучитьИНапечататьВнутреннийКМНоменклатуры(Номенклатура) Экспорт 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВнутренниеКодыМаркировок.ВнутреннийКодМаркировки КАК ВнутреннийКодМаркировки
		|ИЗ
		|	РегистрСведений.ВнутренниеКодыМаркировок КАК ВнутренниеКодыМаркировок
		|ГДЕ
		|	ВнутренниеКодыМаркировок.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ВнутреннийКМ = Выборка.ВнутреннийКодМаркировки;
		Обработка = Обработки.ПечатьКодовМаркировки.Создать();
		Обработка.ПечатьDataMatrix(ВнутреннийКМ, Ложь);
		Прервать;
	КонецЦикла;
	
    Сообщить("У данной номенклатуры нет внутреннего кода маркировки");
КонецПроцедуры 

//=====================================================================================
// Делаем внутренний код маркировки с нуля
//=====================================================================================

Функция ПолучитьШтрихкодНомеклатуры(Номенклатура) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ШтрихКоды.ШтрихКод КАК ШтрихКод
	               |ИЗ
	               |	РегистрСведений.ШтрихКоды КАК ШтрихКоды
	               |ГДЕ
	               |	ШтрихКоды.Объект = &Объект
	               |	И ШтрихКоды.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)";
	Запрос.УстановитьПараметр("Объект", Номенклатура);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ШтрихКод;
	КонецЕсли;

	Возврат "";
КонецФункции 

Функция ПолучитьСледующийНомер(GTIN, Номенклатура) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МАКСИМУМ(СчетчикВнутреннихКМ.СерийныйНомер) КАК МаксНомер
	|ИЗ
	|	РегистрСведений.СчетчикСерийногоНомераДляВнутреннегоКМ КАК СчетчикВнутреннихКМ";

	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.МаксНомер) Тогда
		НовыйНомер = Выборка.МаксНомер + 1;
	Иначе
		НовыйНомер = 1; // регистр вообще пуст - самый первый запуск
	КонецЕсли;

	// 2. Записываем новую запись именно под этот ГТИН
	Набор = РегистрыСведений.СчетчикСерийногоНомераДляВнутреннегоКМ.СоздатьНаборЗаписей();
	Набор.Отбор.GTIN.Установить(GTIN);

	Запись = Набор.Добавить();
	Запись.GTIN = GTIN;
	Запись.СерийныйНомер = НовыйНомер;
	Запись.Номенклатура = Номенклатура;
	
	Набор.Записать(Истина);

	Возврат Формат(НовыйНомер, "ЧЦ=6; ЧГ=0; ЧВН=");
КонецФункции
			                               	
Функция НайтиСгенерированныйКМ(GTIN, Номенклатура) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВнутренниеКодыМаркировок.ВнутреннийКодМаркировки КАК ВнутреннийКодМаркировки
	|ИЗ
	|	РегистрСведений.ВнутренниеКодыМаркировок КАК ВнутренниеКодыМаркировок
	|ГДЕ
	|	ВнутренниеКодыМаркировок.GTIN = &GTIN
	|	И ВнутренниеКодыМаркировок.Номенклатура = &Номенклатура";
	Запрос.УстановитьПараметр("GTIN", GTIN);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ВнутреннийКодМаркировки;
	КонецЕсли;

	Возврат "";
КонецФункции

Функция СгенерироватьВнутреннийКМ(Номенклатура) Экспорт
	ШтрихкодНоменклатуры = ПолучитьШтрихкодНомеклатуры(Номенклатура);
	
	Если ЗначениеЗаполнено(ШтрихкодНоменклатуры) Тогда
		GTIN = "0" + ШтрихкодНоменклатуры;
	Иначе
		Сообщить("У номенклатуры отсутствует штрихкод");
		Возврат "";
	КонецЕсли;                                                
	СуществуетВнутреннийКМ = НайтиСгенерированныйКМ(GTIN, Номенклатура);
	Если ЗначениеЗаполнено(СуществуетВнутреннийКМ) Тогда
		Сообщить("Внутренний код маркировки для данной номенклатуры уже сгенерирован!", СтатусСообщения.Внимание);	
		Сообщить("Проверьте нету ли дубликата данного штрихкода", СтатусСообщения.Внимание);	
		Возврат СуществуетВнутреннийКМ;
	КонецЕсли;
	
	СерйныйНомер = ПолучитьСледующийНомер(GTIN, Номенклатура);
	ВнутреннийКМ = "!SM!" + "01" + GTIN + "21" + СерйныйНомер;
	Сообщить("Сгенерирован новый код маркировки - " + ВнутреннийКМ);
	
	МенеджерЗаписи = РегистрыСведений.ВнутренниеКодыМаркировок.СоздатьМенеджерЗаписи();
    МенеджерЗаписи.ВнутреннийКодМаркировки = ВнутреннийКМ;
    МенеджерЗаписи.Номенклатура            = Номенклатура;
	МенеджерЗаписи.GTIN            		   = GTIN;
	МенеджерЗаписи.СерийныйНомер           = СерйныйНомер;
    МенеджерЗаписи.Записать(Истина);
	
	Возврат ВнутреннийКМ;	
КонецФункции

//=====================================================================================
// Из внешнего кода маркировки делаем внутреннюю
//=====================================================================================

Функция СделатьВнешнююМаркировкуВнутренней(КодМаркировки, Номенклатура) Экспорт

    //Разбираем КМ на GTIN и серийный номер
    ОбработкаШК = Обработки.ШтрихКоды.Создать();
    СтруктураМаркировки = ОбработкаШК.РазобратьСтрокуШтрихкодаGS1(КодМаркировки, Истина);
    
    Если НЕ СтруктураМаркировки.Разобран Тогда
        Сообщить("Не удалось разобрать КМ: " + КодМаркировки, СтатусСообщения.Важное);
        Возврат "";
    КонецЕсли;
    
    GTIN          = СтруктураМаркировки.ДанныеШтрихкода["01"].Значение;
    СерийныйНомер = СтруктураМаркировки.ДанныеШтрихкода["21"].Значение;
    
    //Смотрим состояние в регистре
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ ПЕРВЫЕ 1
    |   СостоянияКМ.Состояние КАК Состояние
    |ИЗ
    |   РегистрСведений.СостоянияКодовМаркировки.СрезПоследних КАК СостоянияКМ
    |ГДЕ
    |   СостоянияКМ.Номенклатура = &Номенклатура
    |   И СостоянияКМ.GTIN = &GTIN
    |   И СостоянияКМ.СерийныйНомер = &СерийныйНомер";
    
    Запрос.УстановитьПараметр("Номенклатура",  Номенклатура);
    Запрос.УстановитьПараметр("GTIN",          GTIN);
    Запрос.УстановитьПараметр("СерийныйНомер", СерийныйНомер);
    
    Выборка = Запрос.Выполнить().Выбрать();
    
    //Если в обороте — не трогаем
    Если Выборка.Следующий() Тогда
		Если Выборка.Состояние = Перечисления.СостоянияКодовМаркировки.ВведенВОборот Тогда
		    Сообщить("КМ в обороте, внутренний код не создаётся: " + КодМаркировки, СтатусСообщения.Важное);
		    Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	//Проверка разработан ли уже внутренниий КМ для внешнего КМ
	ЕстьВнутреннийКМДляВнешнегоКМ = ЕстьВнутреннийКМДляВнешнегоКМ(КодМаркировки);	
	Если ЗначениеЗаполнено(ЕстьВнутреннийКМДляВнешнегоКМ) Тогда
		Сообщить("Внутренний код маркировки уже разработан");
		Возврат ЕстьВнутреннийКМДляВнешнегоКМ;	
	КонецЕсли;
	
    // 4. Делаем внутренний КМ
    ВнешнийКМ = "01" + GTIN + "21" + СерийныйНомер;
    ВнутреннийКМ  = "!SM!" + ВнешнийКМ;
    
    // 5. Пишем в регистр
    МенеджерЗаписи = РегистрыСведений.ВнутренниеКодыМаркировок.СоздатьМенеджерЗаписи();
    МенеджерЗаписи.ВнутреннийКодМаркировки = ВнутреннийКМ;
    МенеджерЗаписи.ВнешнийКодМаркировки    = ВнешнийКМ;
    МенеджерЗаписи.Номенклатура            = Номенклатура;
	МенеджерЗаписи.GTIN            		   = GTIN;
	МенеджерЗаписи.СерийныйНомер           = СерийныйНомер;
    МенеджерЗаписи.Записать(Истина);
    
    Возврат ВнутреннийКМ;
КонецФункции

Функция ЕстьВнутреннийКМДляВнешнегоКМ(ВнешнийКМ) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВнутренниеКодыМаркировок.ВнешнийКодМаркировки КАК ВнешнийКодМаркировки,
		|	ВнутренниеКодыМаркировок.ВнутреннийКодМаркировки КАК ВнутреннийКодМаркировки
		|ИЗ
		|	РегистрСведений.ВнутренниеКодыМаркировок КАК ВнутренниеКодыМаркировок
		|ГДЕ
		|	ВнутренниеКодыМаркировок.ВнешнийКодМаркировки = &ВнешнийКМ";
	
	Запрос.УстановитьПараметр("ВнешнийКМ", ВнешнийКМ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.ВнутреннийКодМаркировки;	
	КонецЦикла;
	
	Возврат "";
КонецФункции
//Дадов 20260916 --

Функция Доступ_К_Автоработам(ЭтотОбъект) Экспорт
	
	 Если РольДоступна("ПолныеПрава") ИЛИ
		     РольДоступна("СМ_ИнженерПоГарантии") ИЛИ
		     РольДоступна("СМ_РуководительОтделаСервиса") ИЛИ
			 РольДоступна("СМГ_ИзменениеИСозданиеАвторобот") ИЛИ
			 (ЭтотОбъект.ПринадлежитЭлементу(Справочники.Автоработы.НайтиПоКоду("ЦБ0164620")) И обПраво("РедактированиеАвторабот"))
			 Тогда
		 Возврат Ложь;
	 ИначеЕсли РольДоступна("СМ_ОператорСервисБюро") ИЛИ
		       РольДоступна("СМ_РуководительМКЦ") ИЛИ
			   РольДоступна("СМ_МастерЦеха") ИЛИ 
			   РольДоступна("СМ_МастерПриемщикМКЦ") ИЛИ
			   РольДоступна("СМ_МастерПриемщик")
			   Тогда
		 Возврат Истина; 
	Иначе
		 Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

//Честный_знак_10.10.2024       

Функция ПолучитьТекстЗапроса() Экспорт
	Возврат "ВЫБРАТЬ
	        |	ПоступлениеАвтомобилейАвтомобили.Ссылка.Дата КАК ДатаПоступления,
	        |	ПоступлениеАвтомобилейАвтомобили.СуммаВсего КАК СуммаВсего,
	        |	ПоступлениеАвтомобилейАвтомобили.СтавкаНДС КАК СтавкаНДС,
	        |	ПоступлениеАвтомобилейАвтомобили.Ссылка КАК Ссылка
	        |ПОМЕСТИТЬ Поступление
	        |ИЗ
	        |	Документ.ПоступлениеАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили
	        |ГДЕ
	        |	ПоступлениеАвтомобилейАвтомобили.Ссылка.Проведен
	        |	И ПоступлениеАвтомобилейАвтомобили.АвтомобильБУ
	        |	И ПоступлениеАвтомобилейАвтомобили.Автомобиль = &Автомобиль
	        |	И (ПоступлениеАвтомобилейАвтомобили.Ссылка.Контрагент.ФормаСобственности В (&ЧастноеЛицо)
	        |			ИЛИ ПоступлениеАвтомобилейАвтомобили.Ссылка.Контрагент.НашаФирма)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	Поступление.ДатаПоступления КАК ДатаПоступления,
	        |	Поступление.СуммаВсего КАК СуммаВсего,
	        |	Поступление.СтавкаНДС КАК СтавкаНДС,
	        |	Поступление.Ссылка КАК Ссылка,
	        |	СУММА(ЕСТЬNULL(ОстаткиАвтомобилейОбороты.СуммаПриход, 0)) КАК СуммаПриход,
	        |	СУММА(ЕСТЬNULL(ОстаткиАвтомобилейОбороты.СуммаРасход, 0)) КАК СуммаРасход
	        |ПОМЕСТИТЬ Итог
	        |ИЗ
	        |	Поступление КАК Поступление
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиАвтомобилей.Обороты(, &КонецПериода, Регистратор, Автомобиль = &Автомобиль) КАК ОстаткиАвтомобилейОбороты
	        |		ПО Поступление.Ссылка = ОстаткиАвтомобилейОбороты.Партия
	        |			И (ОстаткиАвтомобилейОбороты.Регистратор ССЫЛКА Документ.КорректировкаПоступленияАвтомобилей)
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	Поступление.ДатаПоступления,
	        |	Поступление.СуммаВсего,
	        |	Поступление.СтавкаНДС,
	        |	Поступление.Ссылка
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ ПЕРВЫЕ 1
	        |	Итог.Ссылка КАК Ссылка,
	        |	Итог.ДатаПоступления КАК ДатаПоступления,
	        |	Итог.СуммаВсего КАК СуммаВсего,
	        |	Итог.СтавкаНДС КАК СтавкаНДС,
	        |	Итог.СуммаПриход КАК СуммаПриход,
	        |	Итог.СуммаРасход КАК СуммаРасход,
	        |	Итог.СуммаВсего + Итог.СуммаПриход - Итог.СуммаРасход КАК Себестоимость
	        |ИЗ
	        |	Итог КАК Итог
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	ДатаПоступления УБЫВ";	
КонецФункции
